$(function(){
    // swiper插件参数设置
    var swiper = new Swiper('.swiper-container', {
        pagination: '.swiper-pagination',
        slidesPerView: 4,
        paginationHide:true,
        spaceBetween: 0
    }); 
  
    // 头部标题点击切换内容事件
    $(".swiper-wrapper .swiper-slide").click(function(){
        $(".swiper-slide span").removeClass("active");
        $(this).children().addClass("active");
        var index = $(this).index();
        $(".list").find("ul").hide();
        $(".list").find("ul").eq(index).show();
    }); 
    $(".list ul").hide();
    $(".list .select").show();

    forList("zd",listZdData);
    forList("pt",listPtData);
    forList("tj",listTjData);
    forList("zb",listZbData);
    forList("dj",listDjData);
    forList("tc",listTcData);
 
})

 //循环列表
 function forList(dom,data){
    for(i=0;i<data.length;i++){
        $(document.getElementsByClassName(dom)).append("<li><a href='#'>"+data[i]+"<i class='iconfont icon-arrow-right arrow-right'></i></a></li>");
    }
 }
var listZdData = [
    "寿光市智慧农业云平台项目",
    "滨海区新能源汽车产业基地项目",
    "坊子先进制造产业基地项目",
    "潍坊综合保税区项目",
    "潍河、汶河现代农业生态观光园项目",
    "潍坊综合保税区项目",
    "潍河、汶河现代农业生态观光园项目",
    "潍坊综合保税区项目",
    "潍河、汶河现代农业生态观光园项目",
    "潍坊综合保税区项目",
    "潍河、汶河现代农业生态观光园项目",
    "潍坊综合保税区项目",
    "潍河、汶河现代农业生态观光园项目",
    "潍坊综合保税区项目",
    "潍河、汶河现代农业生态观光园项目",
    "潍坊综合保税区项目"
];
var listPtData = [
    "11寿光市智慧农业云平台项目",
    "11滨海区新能源汽车产业基地项目",
    "11坊子先进制造产业基地项目",
    "11潍坊综合保税区项目",
    "11潍河、汶河现代农业生态观光园项目",
    "11潍坊综合保税区项目",
    "11潍河、汶河现代农业生态观光园项目",
    "11潍坊综合保税区项目",
    "11潍河、汶河现代农业生态观光园项目",
    "11潍坊综合保税区项目",
    "11潍河、汶河现代农业生态观光园项目",
    "11潍坊综合保税区项目",
    "11潍河、汶河现代农业生态观光园项目",
    "11潍坊综合保税区项目",
    "11潍河、汶河现代农业生态观光园项目",
    "11潍坊综合保税区项目"
];
var listTjData = [
    "22寿光市智慧农业云平台项目",
    "22滨海区新能源汽车产业基地项目",
    "22坊子先进制造产业基地项目",
    "22潍坊综合保税区项目",
    "22潍河、汶河现代农业生态观光园项目",
    "22潍坊综合保税区项目",
    "22潍河、汶河现代农业生态观光园项目",
    "22潍坊综合保税区项目",
    "22潍河、汶河现代农业生态观光园项目",
    "22潍坊综合保税区项目",
    "22潍河、汶河现代农业生态观光园项目",
    "22潍坊综合保税区项目",
    "22潍河、汶河现代农业生态观光园项目",
    "22潍坊综合保税区项目",
    "22潍河、汶河现代农业生态观光园项目",
    "22潍坊综合保税区项目"
];
var listZbData = [
    "33寿光市智慧农业云平台项目",
    "33滨海区新能源汽车产业基地项目",
    "33坊子先进制造产业基地项目",
    "33潍坊综合保税区项目",
    "33潍河、汶河现代农业生态观光园项目",
    "33潍坊综合保税区项目",
    "33潍河、汶河现代农业生态观光园项目",
    "33潍坊综合保税区项目",
    "33潍河、汶河现代农业生态观光园项目",
    "33潍坊综合保税区项目",
    "33潍河、汶河现代农业生态观光园项目",
    "33潍坊综合保税区项目",
    "33潍河、汶河现代农业生态观光园项目",
    "33潍坊综合保税区项目",
    "33潍河、汶河现代农业生态观光园项目",
    "33潍坊综合保税区项目"
];
var listDjData = [
    "44寿光市智慧农业云平台项目",
    "44滨海区新能源汽车产业基地项目",
    "44坊子先进制造产业基地项目",
    "44潍坊综合保税区项目",
    "44潍河、汶河现代农业生态观光园项目",
    "44潍坊综合保税区项目",
    "44潍河、汶河现代农业生态观光园项目",
    "44潍坊综合保税区项目",
    "44潍河、汶河现代农业生态观光园项目",
    "44潍坊综合保税区项目",
    "44潍河、汶河现代农业生态观光园项目",
    "44潍坊综合保税区项目",
    "44潍河、汶河现代农业生态观光园项目",
    "44潍坊综合保税区项目",
    "44潍河、汶河现代农业生态观光园项目",
    "44潍坊综合保税区项目"
];
var listTcData = [
    "55寿光市智慧农业云平台项目",
    "55滨海区新能源汽车产业基地项目",
    "55坊子先进制造产业基地项目",
    "55潍坊综合保税区项目",
    "55潍河、汶河现代农业生态观光园项目",
    "55潍坊综合保税区项目",
    "55潍河、汶河现代农业生态观光园项目",
    "55潍坊综合保税区项目",
    "55潍河、汶河现代农业生态观光园项目",
    "55潍坊综合保税区项目",
    "55潍河、汶河现代农业生态观光园项目",
    "55潍坊综合保税区项目",
    "55潍河、汶河现代农业生态观光园项目",
    "55潍坊综合保税区项目",
    "55潍河、汶河现代农业生态观光园项目",
    "55潍坊综合保税区项目"
];